/*
Студентам потрібно визначити свій рівень успішності за оцінками, які вони отримали за курс. 
Напишіть програму, яка допоможе студентам визначити свій рівень успішності на основі середньої оцінки.
Створіть змінну averageGrade і присвойте їй середню оцінку студента (від 0 до 100).
За допомогою конструкції if else, визначте та виведіть у консоль рівень успішності студента:
Якщо середня оцінка менше 60, вивести "Незадовільно".
Якщо середня оцінка від 60 до 70 (включно), вивести "Задовільно".
Якщо середня оцінка від 71 до 80 (включно), вивести "Добре".
Якщо середня оцінка від 81 до 90 (включно), вивести "Дуже добре".
Якщо середня оцінка від 91 до 100 (включно), вивести "Відмінно".
*/

let averageGrade = 99;

if (averageGrade > 100 || averageGrade < 0 || typeof averageGrade !== 'number' || isNaN(averageGrade)) {
    console.log("Перевірте правильність введених данних"); // трохи експерементів із валідацією ;)
} else if (averageGrade <= 100 && averageGrade >= 91) {
    console.log("Відмінно");
} else if (averageGrade >= 81) {
    console.log("Дуже добре");
} else if (averageGrade >= 71) {
    console.log("Добре");
} else if (averageGrade >= 60) {
    console.log("Задовільно");
} else if (averageGrade < 60) {
    console.log("Незадовільно");
} else {
    console.log("Неможливо визначати рівень успішності");
}